In [1]:
import numpy as np
import pandas as pd

# Data Operation

Data operation can be performed through various built in methods for faster processing of data

In [2]:
#declare movie rating dataframe: rating from 1 to 5(star * rating)
df_movie_rating = pd.DataFrame({'movie 1':[5,4,3,3,2,1],
                                'movie 2':[4,5,2,3,4,2]},
                              index=['Tom','Jeff','Peter','Ram','Ted','Paul'])

In [3]:
df_movie_rating

       movie 1  movie 2
Tom          5        4
Jeff         4        5
Peter        3        2
Ram          3        3
Ted          2        4
Paul         1        2

# Data Operation with Function

In [4]:
#Data Operation with Function
def movie_grade(rating): #declare the custom function
    if rating==5:
        return 'A'
    if rating==4:
        return 'B'
    if rating==3:
        return 'C'
    else:
        return 'F'

In [5]:
print(movie_grade(5)) #test the function

A

In [6]:
df_movie_rating.applymap(movie_grade)  #apply function for dataframe

      movie 1 movie 2
Tom         A       B
Jeff        B       A
Peter       C       F
Ram         C       C
Ted         F       B
Paul        F       F

# Data operation with statistical functions

In [7]:
df_test_scores = pd.DataFrame({'test1':[95,84,73,88,82,61],
                              'test2':[74,85,82,73,77,79]},
                             index=['Jack','Lewis','Patrick','Rich','Kelly','Paula'])

In [8]:
df_test_scores.max() #to find maximum score

test1    95
test2    85
dtype: int64

In [9]:
df_test_scores.mean()

test1    80.500000
test2    78.333333
dtype: float64

In [10]:
df_test_scores.std() #standered deviaton for both the tests

test1    11.979149
test2     4.633213
dtype: float64

# Data operation using group by

In [11]:
df_president_name = pd.DataFrame({'first':['George','Bill','Ronald','Jimmy','George'],
                                 'last':['Bush','Clinton','Regan','Carter','washington']})

In [12]:
df_president_name

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  washington

In [13]:
grouped = df_president_name.groupby('first') #group the Dataframe with first name

In [14]:
grp_data = grouped.get_group('George') #group the dataframe with firstname
grp_data

    first        last
0  George        Bush
4  George  washington

In [15]:
#sorting values by first name
df_president_name.sort_values('first')

    first        last
1    Bill     Clinton
0  George        Bush
4  George  washington
3   Jimmy      Carter
2  Ronald       Regan

# Data Standardization

In [16]:
def standardize_tests(test):
    return (test-test.mean())/test.std() #create a function to return the standardize value

In [17]:
standardize_tests(df_test_scores['test1'])

Jack       1.210437
Lewis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: test1, dtype: float64

In [18]:
def standardize_test_scores(datafrm):
    return datafrm.apply(standardize_tests) #apply the function to entire dataset

In [19]:
standardize_test_scores(df_test_scores) #standard test data is applied for the entire dataframe

            test1     test2
Jack     1.210437 -0.935276
Lewis    0.292174  1.438886
Patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889


# Pandas SQL commands

In [20]:
import sqlite3 as sq

In [21]:
#create SQL table
create_table = """ CREATE TABLE student_score
(Id INTEGER, Name VARCHAR(20),Math REAL, Science REAL);"""

In [22]:
#execute the sql statement
executeSQL = sq.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

In [23]:
#prepare a sql query
SQL_query = executeSQL.execute('select * from student_score')

In [24]:
#fetch result from the SQLite database
resultset = SQL_query.fetchall()

In [25]:
#view result (empty data)
resultset

[]

In [26]:
# second example
#prepare records to be inserted into sql table through sql stmt
insertSQL = [(10,'Jack',85,92),
            (29,'Tom',73,89),
             (65,'Ram',65.5,77),
            (5,'Steve',55,91)
            ]

In [27]:
#inserting records
insert_statement = "Insert into student_score values(?,?,?,?)"
executeSQL.executemany(insert_statement,insertSQL)
executeSQL.commit()

In [28]:
#prepare sql query
SQL_query = executeSQL.execute('select * from student_score')

In [29]:
#fetch result from the SQLite database
resultset = SQL_query.fetchall()

In [30]:
resultset

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.5, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [31]:
df_student_records = pd.DataFrame(resultset,columns=list(zip(*SQL_query.description))[0])

In [32]:
df_student_records

   Id   Name  Math  Science
0  10   Jack  85.0     92.0
1  29    Tom  73.0     89.0
2  65    Ram  65.5     77.0
3   5  Steve  55.0     91.0